src/buoyantBoussinesqSIMPLES-ScalarTransport/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            patch;
        nFaces          800;
        startFace       159100;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       159900;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       160700;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       160800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          80000;
        startFace       160900;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          80000;
        startFace       240900;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
)

// ************************************************************************* //
