src/buoyantBoussinesqSIMPLES-ScalarTransport/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pressureGradient
{
    type                vectorSemiImplicitSource;
    volumeMode          specific;
    selectionMode       all;
    sources
    {
        U ((0 1.978046e-03  0) 0);
    }
}


atmCoriolisUSource1
{
    type            atmCoriolisUSource;
    selectionMode   all;
    Omega           (0 0 5.65156e-05);
}


atmAmbientTurbSource1
{
    type            atmAmbientTurbSource;
    selectionMode   all;
    kAmb            1.0e-04;
    epsilonAmb      7.208e-08;
}


atmBuoyancyTurbSource1
{
    type            atmBuoyancyTurbSource;
    selectionMode   all;
    rho             rho;
    Lmax            41.0;
    beta            3.3e-03;
}


atmLengthScaleTurbSource1
{
    type            atmLengthScaleTurbSource;
    selectionMode   all;
    Lmax            41.0;
    n               3.0;
}


atmPlantCanopyUSource1
{
    type            atmPlantCanopyUSource;
    selectionMode   all;
}


atmPlantCanopyTSource1
{
    type            atmPlantCanopyTSource;
    selectionMode   all;
}


atmPlantCanopyTurbSource1
{
    type            atmPlantCanopyTurbSource;
    selectionMode   all;
    rho             rho;
}


// ************************************************************************* //
